Extensions/УВМ/Documents/Увольнение.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>Увольнение</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>УВМ_КатегорияПричиныУвольнения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УВМ_КатегорииПричинУвольнения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УВМ_Руководитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УВМ_ФактическаяПричинаУвольнения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаУвольнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Extensions/УВМ/Documents/Увольнение/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
&ИзменениеИКонтроль("ВыполнитьРасчетНачислений")
Процедура УВМ_ВыполнитьРасчетНачислений()

    #Вставка
	//++dar 10.04.23 (99225) выводим кадровикам инфу об ученических договорах
	Если НЕ РегистрацияНачисленийДоступна Тогда
		ОбучениеРазвитиеВызовСервера.УведомитьОбОбязательствахСотрудниковПоУченическимДоговорамСервер(Объект.ФизическоеЛицо, Объект.Организация, Объект.ДатаУвольнения);
	КонецЕсли;
	//--dar 10.04.23 (99225)
	#КонецВставки
	
	Если Не ИспользуетсяРасчетЗарплаты Тогда
		Возврат;
	КонецЕсли;

	ЗарплатаКадрыРасширенныйКлиент.ПодключитьОбработчикОжиданияАвтоматическогоРасчета(
	ЭтотОбъект, РегистрацияНачисленийДоступна, "РассчитатьНачисленияНаКлиенте", , "ОчиститьРассчитанныеДанныеНаКлиенте");

	ПодключитьОбработчикОжиданияФормы("РассчитатьНачисленияНаКлиенте", Ложь);

КонецПроцедуры

&НаСервере
Процедура УВМ_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	//++dar 08.11.23 (146623)
	СвойстваФактическаяПричинаУвольнения = Новый Структура;
	СвойстваФактическаяПричинаУвольнения.Вставить("МногострочныйРежим", Истина);
	УВМ_РаботаСФормами.НовоеПоле(ЭтаФорма, "УВМ_ФактическаяПричинаУвольнения", Элементы.Дополнительно, Истина,,,,СвойстваФактическаяПричинаУвольнения);
	УВМ_РаботаСФормами.НовоеПоле(ЭтаФорма, "УВМ_КатегорияПричиныУвольнения", Элементы.Дополнительно, Истина);
	//--dar 08.11.23 (146623)
	
	//++dar 25.06.25 (255715)
	Если Объект.Дата >= УВМ_КэшированиеЗначений.ПолучитьДатуНачалаУчетаРуководителей() Тогда
		УВМ_РаботаСФормами.НовоеПоле(ЭтотОбъект, "УВМ_Руководитель", "УсловияУвольнения", Истина, , , "ИО сотрудника");
	КонецЕсли;
	//--dar 25.06.25 (255715)
	
КонецПроцедуры
